Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TypesOfProducts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ProductKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ProductKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Product</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Service</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Products/Forms/ItemForm/Ext/Form/Module.bsl
&AtClient
Procedure KindOnChange(Item)
	ShowProp();
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	ShowProp();
EndProcedure

&AtServerNoContext
Function TypeForProduct()
	Return Enums.ProductKinds.Product;
Endfunction

&AtServerNoContext
Function TypeForSrvice()
	Return Enums.ProductKinds.Service;
Endfunction

&AtClient
Procedure ShowProp()
	If Object.Kind =  TypeForProduct() then
		Items.ProductsType.Visible = True;
		Items.Periodicity.Visible = False;
	EndIf;
	
	If Object.Kind =  TypeForSrvice() then
	    Items.ProductsType.Visible = False;
		Items.Periodicity.Visible =  True;
	EndIf;
EndProcedure
